In [1]:
import numpy as np
import pandas as pd

In [2]:
name = pd.Series(range(500))
name.tail()
name.head(10)

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

In [3]:
nums = pd.Series([1,2,np.nan,4,5])
nums

0    1.0
1    2.0
2    NaN
3    4.0
4    5.0
dtype: float64

In [4]:
hello = pd.Series(list("hello"))
hello

0    h
1    e
2    l
3    l
4    o
dtype: object

In [5]:
a = hello.nunique()
# 4

In [6]:
b = len(hello)
# 5

In [7]:
b-a

1

In [8]:
nums.count()
# nan값을 제외한 데이터 개수를 알려줌

len(nums)
# 제외하는 데이터 없이 길이를 계산함

nums.sum()
# nan값은 제외하고 총합을 구함

nums.sum(skipna=False)
# nan값을 스킵하는 거 하지 말라는 뜻

nan

In [9]:
nums.std()

1.8257418583505538

In [10]:
somechar = pd.Series(list('AaBbCc'))
somechar

0    A
1    a
2    B
3    b
4    C
5    c
dtype: object

In [11]:
somechar.max()

'c'

In [12]:
hello.describe()

count     5
unique    4
top       l
freq      2
dtype: object

In [13]:
nums.describe()

count    4.000000
mean     3.000000
std      1.825742
min      1.000000
25%      1.750000
50%      3.000000
75%      4.250000
max      5.000000
dtype: float64

In [14]:
nums

0    1.0
1    2.0
2    NaN
3    4.0
4    5.0
dtype: float64

In [15]:
list(nums)

[1.0, 2.0, nan, 4.0, 5.0]

In [16]:
dict(nums)

{0: 1.0, 1: 2.0, 2: nan, 3: 4.0, 4: 5.0}

In [17]:
superheros = [
    "Batman",
    "Superman",
    "Spider-Man",
    "Iron Man",
    "Captain America",
    "Wonder Woman"
]
strength_levels = (100, 120, 90, 95, 110, 120)

a = pd.Series(superheros,strength_levels)
a

100             Batman
120           Superman
90          Spider-Man
95            Iron Man
110    Captain America
120       Wonder Woman
dtype: object

In [18]:
a.tail(4)

90          Spider-Man
95            Iron Man
110    Captain America
120       Wonder Woman
dtype: object

In [19]:
a.nunique()

6

In [20]:
dict(a)

{100: 'Batman',
 120: 120        Superman
 120    Wonder Woman
 dtype: object,
 90: 'Spider-Man',
 95: 'Iron Man',
 110: 'Captain America'}

In [21]:
pokemons = pd.read_csv('datas/pokemon.csv', index_col='Pokemon').squeeze()
pokemons

Pokemon
Bulbasaur      Grass / Poison
Ivysaur        Grass / Poison
Venusaur       Grass / Poison
Charmander               Fire
Charmeleon               Fire
                    ...
Stakataka        Rock / Steel
Blacephalon      Fire / Ghost
Zeraora              Electric
Meltan                  Steel
Melmetal                Steel
Name: Type, Length: 809, dtype: object

In [22]:
pokemons.count()
pokemons.nunique()
pokemons.max()
pokemons.describe()

count        809
unique       159
top       Normal
freq          65
Name: Type, dtype: object

In [23]:
# 내림차순 정렬
pokemons.sort_values(ascending=False)

Pokemon
Empoleon      Water / Steel
Corsola        Water / Rock
Relicanth      Water / Rock
Carracosta     Water / Rock
Tirtouga       Water / Rock
                  ...
Kricketune              Bug
Cascoon                 Bug
Scatterbug              Bug
Kricketot               Bug
Grubbin                 Bug
Name: Type, Length: 809, dtype: object

In [24]:
google = pd.read_csv('datas/google_stocks.csv',
                    parse_dates=['Date'],
                    index_col='Date').squeeze('columns')
google.sort_values

<bound method Series.sort_values of Date
2004-08-19      49.98
2004-08-20      53.95
2004-08-23      54.50
2004-08-24      52.24
2004-08-25      52.80
               ...
2019-10-21    1246.15
2019-10-22    1242.80
2019-10-23    1259.13
2019-10-24    1260.99
2019-10-25    1265.13
Name: Close, Length: 3824, dtype: float64>

In [25]:
war = pd.read_csv('datas/revolutionary_war.csv',
                 parse_dates=['Start Date'],
                 index_col='Start Date',
                 usecols=['Start Date','State'],
                 squeeze=True)
war

C:\Users\user\AppData\Local\Temp\ipykernel_5028\510573329.py:1: FutureWarning: The squeeze argument has been deprecated and will be removed in a future version. Append .squeeze("columns") to the call to squeeze.


  war = pd.read_csv('datas/revolutionary_war.csv',

Start Date
1774-09-01    Massachusetts
1774-12-14    New Hampshire
1775-04-19    Massachusetts
1775-04-19    Massachusetts
1775-04-20         Virginia
                  ...
1782-09-11         Virginia
1782-09-13              NaN
1782-10-18              NaN
1782-12-06              NaN
1783-01-22         Virginia
Name: State, Length: 232, dtype: object

In [26]:
war = pd.read_csv('datas/revolutionary_war.csv',
                 parse_dates=['Start Date'],
                 index_col='Start Date',
                 usecols=['Start Date','State'],
                 squeeze=True)
# 결측치를 제외 값의 개수(162)
a=war[war.notnull()]
a.count()

war.count()
# 유일한 값의 개수(17)
war.nunique()
# nan값 데이터 개수(70)
a=war.isnull()
a.count()

war.isnull().sum()

len(war)-war.count()

C:\Users\user\AppData\Local\Temp\ipykernel_5028\3304722115.py:1: FutureWarning: The squeeze argument has been deprecated and will be removed in a future version. Append .squeeze("columns") to the call to squeeze.


  war = pd.read_csv('datas/revolutionary_war.csv',

70

In [27]:
war.sort_values(na_position='first')

Start Date
1775-09-17         NaN
1775-12-31         NaN
1776-03-03         NaN
1776-03-25         NaN
1776-05-18         NaN
                ...
1781-07-06    Virginia
1781-07-01    Virginia
1781-06-26    Virginia
1781-04-25    Virginia
1783-01-22    Virginia
Name: State, Length: 232, dtype: object

In [28]:
war.sort_values(na_position='last')

Start Date
1781-09-06    Connecticut
1779-07-05    Connecticut
1777-04-27    Connecticut
1777-09-03       Delaware
1777-05-17        Florida
                 ...
1782-08-08            NaN
1782-08-25            NaN
1782-09-13            NaN
1782-10-18            NaN
1782-12-06            NaN
Name: State, Length: 232, dtype: object

In [29]:
war.dropna()

Start Date
1774-09-01     Massachusetts
1774-12-14     New Hampshire
1775-04-19     Massachusetts
1775-04-19     Massachusetts
1775-04-20          Virginia
                   ...
1782-08-15          Virginia
1782-08-19          Virginia
1782-08-26    South Carolina
1782-09-11          Virginia
1783-01-22          Virginia
Name: State, Length: 162, dtype: object

In [30]:
pokemons.sort_index(ascending=False)

Pokemon
Zygarde      Dragon / Ground
Zweilous       Dark / Dragon
Zubat        Poison / Flying
Zorua                   Dark
Zoroark                 Dark
                  ...
Aegislash      Steel / Ghost
Accelgor                 Bug
Absol                   Dark
Abra                 Psychic
Abomasnow        Grass / Ice
Name: Type, Length: 809, dtype: object

In [31]:
# 인덱스에서 NaT을 없애는 방법 두 가지
war.loc[war.index.dropna()]

# 1:1 maping으로 없애는 것이기 때문에 notnull이 더 정확함
war.loc[war.index.notnull()]

Start Date
1774-09-01    Massachusetts
1774-12-14    New Hampshire
1775-04-19    Massachusetts
1775-04-19    Massachusetts
1775-04-20         Virginia
                  ...
1782-09-11         Virginia
1782-09-13              NaN
1782-10-18              NaN
1782-12-06              NaN
1783-01-22         Virginia
Name: State, Length: 228, dtype: object

In [32]:
# 가장 작은 값 10개
google.sort_values().head(10)

Date
2004-09-03    49.82
2004-09-01    49.94
2004-08-19    49.98
2004-09-02    50.57
2004-09-07    50.60
2004-08-30    50.81
2004-09-08    50.96
2004-09-09    50.96
2004-08-31    50.99
2004-08-24    52.24
Name: Close, dtype: float64

In [33]:
# 가장 큰 값 10개
google.sort_values(ascending=False).head(10)

Date
2019-04-29    1287.58
2019-04-26    1272.18
2018-07-26    1268.33
2019-10-25    1265.13
2019-04-23    1264.55
2018-07-25    1263.70
2019-04-25    1263.45
2019-10-24    1260.99
2019-10-23    1259.13
2019-04-24    1256.00
Name: Close, dtype: float64

In [34]:
# Top 10 Biggiest Numbers
google.nlargest(10)

Date
2019-04-29    1287.58
2019-04-26    1272.18
2018-07-26    1268.33
2019-10-25    1265.13
2019-04-23    1264.55
2018-07-25    1263.70
2019-04-25    1263.45
2019-10-24    1260.99
2019-10-23    1259.13
2019-04-24    1256.00
Name: Close, dtype: float64

In [35]:
# Bottom 10 samllest numbers
google.nsmallest(10)

Date
2004-09-03    49.82
2004-09-01    49.94
2004-08-19    49.98
2004-09-02    50.57
2004-09-07    50.60
2004-08-30    50.81
2004-09-08    50.96
2004-09-09    50.96
2004-08-31    50.99
2004-08-24    52.24
Name: Close, dtype: float64

In [36]:
pokemons.value_counts()

Normal                65
Water                 61
Grass                 38
Psychic               35
Fire                  30
                      ..
Fire / Psychic         1
Normal / Ground        1
Psychic / Fighting     1
Dark / Ghost           1
Fire / Ghost           1
Name: Type, Length: 159, dtype: int64

In [37]:
bins = np.linspace(0,1400,8)
bins

array([   0.,  200.,  400.,  600.,  800., 1000., 1200., 1400.])

In [38]:
bins = np.linspace(0,1400,8)
# bins
# array([   0.,  200.,  400.,  600.,  800., 1000., 1200., 1400.])
google.value_counts(bins=bins)
# bins라는 인수 안에 구간을 넣는다
# bins는 구간 나눠서 숫자들을 정렬할 수 있게 해주는 역할

(200.0, 400.0]      1568
(-0.001, 200.0]      595
(400.0, 600.0]       575
(1000.0, 1200.0]     406
(600.0, 800.0]       380
(800.0, 1000.0]      207
(1200.0, 1400.0]      93
Name: Close, dtype: int64

In [39]:
a = np.arange(0,1201,200)
google = google.value_counts(bins=a)
google.sort_index()

(-0.001, 200.0]      595
(200.0, 400.0]      1568
(400.0, 600.0]       575
(600.0, 800.0]       380
(800.0, 1000.0]      207
(1000.0, 1200.0]     406
Name: Close, dtype: int64

In [40]:
google.value_counts(bins=8, sort=False)

(205.638, 377.125]     1
(377.125, 547.25]      2
(547.25, 717.375]      2
(717.375, 887.5]       0
(887.5, 1057.625]      0
(1057.625, 1227.75]    0
(1227.75, 1397.875]    0
(1397.875, 1568.0]     1
Name: Close, dtype: int64

In [41]:
google = pd.read_csv('datas/google_stocks.csv',
                    parse_dates=['Date'],
                    index_col='Date').squeeze('columns')
google.value_counts(bins=8, sort=False)

(48.581, 204.54]       651
(204.54, 359.26]      1435
(359.26, 513.98]       263
(513.98, 668.7]        466
(668.7, 823.42]        334
(823.42, 978.14]       161
(978.14, 1132.86]      283
(1132.86, 1287.58]     231
Name: Close, dtype: int64

In [42]:
google = pd.read_csv('datas/google_stocks.csv',
                    parse_dates=['Date'],
                    index_col='Date').squeeze('columns')
google.value_counts(bins=8)

(204.54, 359.26]      1435
(48.581, 204.54]       651
(513.98, 668.7]        466
(668.7, 823.42]        334
(978.14, 1132.86]      283
(359.26, 513.98]       263
(1132.86, 1287.58]     231
(823.42, 978.14]       161
Name: Close, dtype: int64

In [43]:
df_csv = pd.DataFrame({'c1':[1,2,'누락'],'c2':[1.11,'',3.33], 'c3':['one','two','three']})
df_csv

   c1    c2     c3
0   1  1.11    one
1   2          two
2  누락  3.33  three

In [44]:
df_csv.to_csv('datas/sample1.csv', index=False)

In [45]:
%pwd

'C:\\python'

In [46]:
%cd c:\\python

c:\python

In [47]:
df_read=pd.read_csv('datas/sample1.csv')
df_read

   c1    c2     c3
0   1  1.11    one
1   2   NaN    two
2  누락  3.33  three

In [48]:
# 저장할 때
df_csv.to_csv('sample2.csv', index=False, header=False)

In [49]:
# 불러올 때
pd.read_csv('sample2.csv', names=['c1','c2','c3'])

   c1    c2     c3
0   1  1.11    one
1   2   NaN    two
2  누락  3.33  three

In [50]:
%%writefile sample3.txt
c1        c2        c3        c4
0.179181 -1.538472  1.347553  0.43381
1.024209  0.087307 -1.281997  0.49265
0.417899 -2.002308  0.255245 -1.10515

Overwriting sample3.txt

In [51]:
pd.read_table('sample3.txt',sep='\s+')

         c1        c2        c3       c4
0  0.179181 -1.538472  1.347553  0.43381
1  1.024209  0.087307 -1.281997  0.49265
2  0.417899 -2.002308  0.255245 -1.10515

In [52]:
%%writefile datas/sample4.txt
파일 제목: sample4.txt
데이터 포맷의 설명:
c1, c2, c3
1, 1.11, one
2, 2.22, two
3, 3.33, three

Overwriting datas/sample4.txt

In [53]:
pd.read_csv('datas/sample4.txt', skiprows=[0,1])

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

In [54]:
df_na_val = pd.read_csv('datas/sample1.csv', na_values=['누락'])
df_na_val

    c1    c2     c3
0  1.0  1.11    one
1  2.0   NaN    two
2  NaN  3.33  three

In [55]:
df_na_val.to_csv('sample5.txt', sep='|')

In [56]:
df_na_val.to_csv('sample6.csv', na_rep='누락')

In [57]:
titanic = pd.read_csv("https://storage.googleapis.com/tf-datasets/titanic/train.csv"

)

In [58]:
titanic

,survived,sex,age,n_siblings_spouses,parch,fare,class,deck,embark_town,alone
0,0,male,22.0,1,0,7.2500,Third,unknown,Southampton,n
1,1,female,38.0,1,0,71.2833,First,C,Cherbourg,n
2,1,female,26.0,0,0,7.9250,Third,unknown,Southampton,y
3,1,female,35.0,1,0,53.1000,First,C,Southampton,n
4,0,male,28.0,0,0,8.4583,Third,unknown,Queenstown,y
...,...,...,...,...,...,...,...,...,...,...
622,0,male,28.0,0,0,10.5000,Second,unknown,Southampton,y
623,0,male,25.0,0,0,7.0500,Third,unknown,Southampton,y
624,1,female,19.0,0,0,30.0000,First,B,Southampton,y
625,0,female,28.0,1,2,23.4500,Third,unknown,Southampton,n
626,0,male,32.0,0,0,7.7500,Third,unknown,Queenstown,y

In [59]:
titanic.head(20)

,survived,sex,age,n_siblings_spouses,parch,fare,class,deck,embark_town,alone
0,0,male,22.0,1,0,7.2500,Third,unknown,Southampton,n
1,1,female,38.0,1,0,71.2833,First,C,Cherbourg,n
2,1,female,26.0,0,0,7.9250,Third,unknown,Southampton,y
3,1,female,35.0,1,0,53.1000,First,C,Southampton,n
4,0,male,28.0,0,0,8.4583,Third,unknown,Queenstown,y
5,0,male,2.0,3,1,21.0750,Third,unknown,Southampton,n
6,1,female,27.0,0,2,11.1333,Third,unknown,Southampton,n
7,1,female,14.0,1,0,30.0708,Second,unknown,Cherbourg,n
8,1,female,4.0,1,1,16.7000,Third,G,Southampton,n
9,0,male,20.0,0,0,8.0500,Third,unknown,Southampton,y
10,0,male,39.0,1,5,31.2750,Third,unknown,Southampton,n
11,0,female,14.0,0,0,7.8542,Third,unknown,Southampton,y
12,0,male,2.0,4,1,29.1250,Third,unknown,Queenstown,n
13,1,male,28.0,0,0,13.0000,Second,unknown,Southampton,y
14,0,female,31.0,1,0,18.0000,Third,unknown,Southampton,n
15,1,female,28.0,0,0,7.2250,Third,unknown,Cherbourg,y
16,0,male,35.0,0,0,26.0000,Second,unknown,Southampton,y
17,1,male,28.0,0,0,35.5000,First,A,Southampton,y
18,1,female,38.0,1,5,31.3875,Third,unknown,Southampton,n
19,0,male,28.0,0,0,7.2250,Third,unknown,Cherbourg,y

In [60]:
financial_data = pd.read_csv('business-financial-data-september-2022-quarter.csv')
financial_data

,Series_reference,Period,Data_value,Suppressed,STATUS,UNITS,Magnitude,Subject,Group,Series_title_1,Series_title_2,Series_title_3,Series_title_4,Series_title_5
0,BDCQ.SF1AA2CA,2016.06,1116.386,NaN,F,Dollars,6,Business Data Collection - BDC,Industry by financial variable (NZSIOC Level 2),Sales (operating income),Forestry and Logging,Current prices,Unadjusted,NaN
1,BDCQ.SF1AA2CA,2016.09,1070.874,NaN,F,Dollars,6,Business Data Collection - BDC,Industry by financial variable (NZSIOC Level 2),Sales (operating income),Forestry and Logging,Current prices,Unadjusted,NaN
2,BDCQ.SF1AA2CA,2016.12,1054.408,NaN,F,Dollars,6,Business Data Collection - BDC,Industry by financial variable (NZSIOC Level 2),Sales (operating income),Forestry and Logging,Current prices,Unadjusted,NaN
3,BDCQ.SF1AA2CA,2017.03,1010.665,NaN,F,Dollars,6,Business Data Collection - BDC,Industry by financial variable (NZSIOC Level 2),Sales (operating income),Forestry and Logging,Current prices,Unadjusted,NaN
4,BDCQ.SF1AA2CA,2017.06,1233.700,NaN,F,Dollars,6,Business Data Collection - BDC,Industry by financial variable (NZSIOC Level 2),Sales (operating income),Forestry and Logging,Current prices,Unadjusted,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
6190,BDCQ.SF8RSCA,2021.09,382.195,NaN,F,Dollars,6,Business Data Collection - BDC,Industry by financial variable (NZSIOC Level 1),Operating profit,"Arts, Recreation and Other Services",Current,Unadjusted,NaN
6191,BDCQ.SF8RSCA,2021.12,397.184,NaN,F,Dollars,6,Business Data Collection - BDC,Industry by financial variable (NZSIOC Level 1),Operating profit,"Arts, Recreation and Other Services",Current,Unadjusted,NaN
6192,BDCQ.SF8RSCA,2022.03,493.945,NaN,F,Dollars,6,Business Data Collection - BDC,Industry by financial variable (NZSIOC Level 1),Operating profit,"Arts, Recreation and Other Services",Current,Unadjusted,NaN
6193,BDCQ.SF8RSCA,2022.06,579.955,NaN,R,Dollars,6,Business Data Collection - BDC,Industry by financial variable (NZSIOC Level 1),Operating profit,"Arts, Recreation and Other Services",Current,Unadjusted,NaN
6194,BDCQ.SF8RSCA,2022.09,609.161,NaN,F,Dollars,6,Business Data Collection - BDC,Industry by financial variable (NZSIOC Level 1),Operating profit,"Arts, Recreation and Other Services",Current,Unadjusted,NaN

In [63]:
crimes = pd.read_csv('SacramentocrimeJanuary2006.csv')
len(crimes)

7584

In [64]:
crimes.dtypes

cdatetime         object
address           object
district           int64
beat              object
grid               int64
crimedescr        object
ucr_ncic_code      int64
latitude         float64
longitude        float64
dtype: object

In [66]:
crimes.sum(numeric_only=True)

district         2.711000e+04
grid             6.948846e+06
ucr_ncic_code    3.242212e+07
latitude         2.924376e+05
longitude       -9.211817e+05
dtype: float64

In [67]:
crimes[['crimedescr']]

                         crimedescr
0     10851(A)VC TAKE VEH W/O OWNER
1        459 PC  BURGLARY RESIDENCE
2     10851(A)VC TAKE VEH W/O OWNER
3      476 PC PASS FICTICIOUS CHECK
4      459 PC  BURGLARY-UNSPECIFIED
...                             ...
7579  594(B)(2)(A) VANDALISM/ -$400
7580      459 PC  BURGLARY BUSINESS
7581        TRAFFIC-ACCIDENT INJURY
7582        3056 PAROLE VIO - I RPT
7583    TRAFFIC-ACCIDENT-NON INJURY

[7584 rows x 1 columns]